Revit 2027 API
RebarShapeParameters.GetAllRebarShapeParameters Method
 List all shape parameters used by all the existing RebarShapes in the specified document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetAllRebarShapeParameters(
	Document doc
)
Public Shared Function GetAllRebarShapeParameters (
	doc As Document
) As IList(Of ElementId)
public:
static IList<ElementId^>^ GetAllRebarShapeParameters(
	Document^ doc
)
static member GetAllRebarShapeParameters :
        doc : Document -> IList<ElementId>
Parameters
doc Document
 The document.
Return Value
IList<ElementId>
 ElementIds corresponding to the external parameters.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This method replaces RebarShape.GetAllRebarShapeParameters() from prior releases.
See Also
Reference
RebarShapeParameters Class
Autodesk.Revit.DB.Structure Namespace